Autodesk.Revit.DB.BuiltInFailures.RevolutionFailures.ProfileNotPlanar
The Profile must lie in a plane.

Autodesk.Revit.DB.BuiltInFailures.RevolutionFailures.ProfileCrossesRevolutionAxis
The profile must not cross the axis of revolution.

Autodesk.Revit.DB.BuiltInFailures.RevolutionFailures.CannotDrawRevolution
Can't create surface of revolution.

Autodesk.Revit.DB.BuiltInFailures.RevolutionFailures
Failures about Revolution.